{
  "model": "TDAI-2170",
  "manual_type": "owners",
  "toc": [
    {
      "title": "TDAI- 2170",
      "page": 1
    },
    {
      "title": "INTEGRATED AMPLIFIER &",
      "page": 2
    },
    {
      "title": "AUDIO PROCESSOR",
      "page": 3
    },
    {
      "title": "OWNER’S MANUAL",
      "page": 4
    },
    {
      "title": "Contents",
      "page": 5
    },
    {
      "title": "COMPLIANCE",
      "page": 6
    },
    {
      "title": "WEEE",
      "page": 7
    },
    {
      "title": "FCC",
      "page": 8
    },
    {
      "title": "What’s in the box",
      "page": 9
    },
    {
      "title": "Remote Control",
      "page": 10
    },
    {
      "title": "2",
      "page": 11
    },
    {
      "title": "3",
      "page": 12
    },
    {
      "title": "4",
      "page": 13
    },
    {
      "title": "7",
      "page": 14
    },
    {
      "title": "1",
      "page": 15
    },
    {
      "title": "Front Panel",
      "page": 16
    },
    {
      "title": "Rear Panel",
      "page": 17
    },
    {
      "title": "HOW TO GET STARTED / Speaker setup guide",
      "page": 18
    },
    {
      "title": "Speaker setup guide",
      "page": 19
    },
    {
      "title": "Using the TDAI-2170 in a Surround System",
      "page": 20
    },
    {
      "title": "Menu walkthrough",
      "page": 21
    },
    {
      "title": "1 RoomPerfectTM",
      "page": 22
    },
    {
      "title": "2 Voicing",
      "page": 23
    },
    {
      "title": "3 Speaker setup",
      "page": 24
    },
    {
      "title": "4 Setup",
      "page": 25
    },
    {
      "title": "4.1 Inputs",
      "page": 26
    },
    {
      "title": "4.2 RoomPerfectTM setup",
      "page": 27
    },
    {
      "title": "4.3 Volume",
      "page": 28
    },
    {
      "title": "4.4 Voicings",
      "page": 29
    },
    {
      "title": "4.5 Display",
      "page": 30
    },
    {
      "title": "4.6 HDMI",
      "page": 31
    },
    {
      "title": "NOTE:",
      "page": 32
    },
    {
      "title": "5 Advanced settings",
      "page": 33
    },
    {
      "title": "5.1 Auto off",
      "page": 34
    },
    {
      "title": "5.2 Remote control",
      "page": 35
    },
    {
      "title": "5.3 ICC",
      "page": 36
    },
    {
      "title": "5.4 Speaker setup guide",
      "page": 37
    },
    {
      "title": "5.5 Second speaker setup",
      "page": 38
    },
    {
      "title": "5.6 Outputs",
      "page": 39
    },
    {
      "title": "5.7 Trigger mode",
      "page": 40
    },
    {
      "title": "5.8 Lock setup",
      "page": 41
    },
    {
      "title": "5.9 Software info",
      "page": 42
    },
    {
      "title": "5.10 Factory reset",
      "page": 43
    },
    {
      "title": "FAQ and recommendations",
      "page": 44
    },
    {
      "title": "RoomPerfectTM troubleshooting",
      "page": 45
    },
    {
      "title": "Cleaning and maintenance",
      "page": 46
    },
    {
      "title": "Serial control manual",
      "page": 47
    },
    {
      "title": "Technical assistance",
      "page": 48
    },
    {
      "title": "4.",
      "page": 49
    }
  ],
  "sections": [
    {
      "title": "TDAI- 2170",
      "content": "",
      "page": 1
    },
    {
      "title": "INTEGRATED AMPLIFIER &",
      "content": "",
      "page": 2
    },
    {
      "title": "AUDIO PROCESSOR",
      "content": "",
      "page": 3
    },
    {
      "title": "OWNER’S MANUAL",
      "content": "```\nApril 2021\n```",
      "page": 4
    },
    {
      "title": "Contents",
      "content": "- What’s in the box\n- Remote Control\n- Front Panel\n- Rear Panel\n- Speaker setup guide\n- Using the TDAI-2170 in a Surround System\n- Menu walkthrough\n- 1 RoomPerfectTM\n- 2 Voicing\n- 3 Speaker setup\n- 4 Setup\n- 4.1 Inputs\n- 4.2 RoomPerfectTM setup\n- 4.3 Volume\n- 4.4 Voicings\n- 4.5 Display\n- 4.6 HDMI\n- 5 Advanced settings\n- 5.1 Auto off\n- 5.2 Remote control\n- 5.3 ICC\n- 5.4 Speaker setup guide\n- 5.5 Second speaker setup\n- 5.6 Outputs\n- 5.7 Trigger mode\n- 5.8 Lock setup\n- 5.9 Software info\n- 5.10 Factory reset\n- FAQ and recommendations\n- RoomPerfectTM troubleshooting\n- Cleaning and maintenance\n- Serial control manual\n- Technical assistance\n\n\n```\nWelcome\n```\nCongratulations on your purchase of the Lyngdorf Audio TDAI-2170 fully digital amplifier with Room- Perfect™.\n\nWith this purchase, you have joined the ranks of an elite group of people who believe that perfect sound is more than\na luxury. It’s a requirement. The TDAI-2170 will deliver an audio experience that will far exceed your expectations. We\nthank you for placing your confidence in Lyngdorf Audio.\n\nThis manual will give you an overview of how to set up your system. Please read the manual carefully to better\nunderstand the capabilities of your TDAI-2170. For more in-depth information about the technologies used in\nLyngdorf Audio products, please visit [http://www.lyngdorf.com.](http://www.lyngdorf.com.)",
      "page": 5
    },
    {
      "title": "COMPLIANCE",
      "content": "",
      "page": 6
    },
    {
      "title": "WEEE",
      "content": "The European Parliament and the Council of the European Union have issued the Waste Electrical and Electronic\nEquipment Directive. The purpose of the Directive is to prevent waste of electrical and electronic equipment and to\npromote reuse, recycling, and other forms of waste recovery. Lyngdorf products and the accessories packed with\nthem are subject to the WEEE Directive. Please dispose of any waste materials in accordance with your local recycling\nregulations. Products and equipment which must be collected for reuse, recycling, and other forms of recovery are\nmarked with the icon of the crossed-out waste receptacle.",
      "page": 7
    },
    {
      "title": "FCC",
      "content": "Lyngdorf products and accessories comply with parts 15 and 68 of the FCC rules. Operation is subject to the following\ntwo conditions: (1) this device may not cause harmful interference; and (2) this device must accept any interference\nreceived, including any interference that may cause undesired operation.",
      "page": 8
    },
    {
      "title": "What’s in the box",
      "content": "```\nMicrophone stand\n```\n```\nTDAI-\n```\n```\nMains cord 8 m (26 feet) XLR – XLR cable\n```\n```\nMicrophone\n```\nRemote control\n\n```\nAMP\n```\n```\ndigital\nAMP\nENTER\n```\n```\nCD\n```\n```\ninfo menu\nsource volume\n```\n```\nrandom repeat\n```\n```\nanalog\n```\n```\nCD\n```",
      "page": 9
    },
    {
      "title": "Remote Control",
      "content": "The most frequently used buttons\n\n**1. Standby** Turns the TDAI-2170 on and into standby.\n**2. Digital and Analog** Selects input type - or if already active,\ncycles to the next input.\n**3. AMP / CD** Changes remote operation between the TDAI and the\nLyngdorf CD player.\n**4. Up/Down** Toggles between the available RoomPerfect™ filters\nand increases or decreases settings in the menu.\n**5. Left/Right** Toggles between neutral and the available voicings\nand is used to browse in the menu.\n**6. Enter** Choose a menu or setting\n\n```\n7.Info Shows information of level and type of input signal.\n```\n**8. Menu** Press to enter the menu. When in the menu press to go\nback or cancel.\n**9. Source -/+** Toggles between active inputs.\n**10. Volume** Increase or decrease the volume level\n\n**Notes:**\nThe buttons below are for controlling a Lyngdorf CD Player only\n\nIf the TDAI-2170 isn’t responding to the volume control of the remote, press the AMP key and try again. If that doesn ́t\nwork, check the two AAA batteries.\n\n```\nAMP\n```\n```\ndigital\n```\n```\nAMP\n```\n```\nENTER\n```\n```\nCD\n```\n```\ninfo menu\n```\n```\nsource volume\n```\n```\nrandom repeat\n```\n```\nanalog\n```\n```\nCD\n```",
      "page": 10
    },
    {
      "title": "2",
      "content": "(^56)",
      "page": 11
    },
    {
      "title": "3",
      "content": "",
      "page": 12
    },
    {
      "title": "4",
      "content": "",
      "page": 13
    },
    {
      "title": "7",
      "content": "",
      "page": 14
    },
    {
      "title": "1",
      "content": "",
      "page": 15
    },
    {
      "title": "Front Panel",
      "content": "**Left to Right:**\n\n**1. Source/menu**\n    Press and hold to access the menu, press to select a menu item, press and hold to exit a menu. Rotate left\n    and right to toggle between audio sources and browse while in the menu. Press to mute and unmute.\n**2. Volume wheel**\n    Adjust the volume with left or right rotation.\n**3. Standby button**\n    Turns the TDAI-2170 on and into standby.",
      "page": 16
    },
    {
      "title": "Rear Panel",
      "content": "On the back of the TDAI-2170, you can find a range of inputs and output connectors:\n\n**Top Row / Left to Right:**\n\n- Optional Module with 1 x phono (MM), 2 x single ended, and 1 x balanced analog audio inputs\n- Optional Module with 1 x TV HDMI output (ARC) and 3 HDMI inputs, all 4K /HDR compatible\n- Speaker Outputs\n\n**Low Row / Left to Right**\n\n- 2 x single ended analog audio inputs\n- 1 x single ended analog audio output\n- 1 x balanced analog microphone input (for RoomPerfect™ calibration)\n- 2 x coaxial digital audio inputs\n- 4 x optical digital audio inputs\n- 1 x coaxial digital audio output\n- 1 x USB A connector for software updating (FAT32 Format required)\n- 1 x RJ12 connector for serial control of the unit\n- 1 x trigger input and 1 x trigger output\n- 1 x Mains voltage connector",
      "page": 17
    },
    {
      "title": "HOW TO GET STARTED / Speaker setup guide",
      "content": "Set up the TDAI-2170 integrated amplifier by following these steps:\n\n1. Connect the speakers and subwoofer(s) to the Speaker Output connectors – see below.\n2. Connect all external equipment, audio and video, mains power, etc. to the TDAI-2170.\n3. Connect the TDAI-2170 to the mains power and turn on the mains switch.\n4. Switch on the TDAI-2170 using the front stand-by button.\n\nWhen the TDAI- 2170 is turned on for the first time, the Speaker\nSetup Guide will start. This guide will ensure that you pass through\nthe full setup process, but you can always back out of this guide by\na long press on the Source/Menu button.\n\nSettings can be modified later under the Output Menu – or you\ncan activate the Speaker Setup Guide to start all over.\n\nWhen connecting the speakers, always connect + and - from the\namplifier to the corresponding + and - terminals on the speaker.\n\n**Warning** :\nNever run the TDAI-2170 in bridged mode with other amplifiers – nor should you never connect speaker cables to\n‘High Level’ inputs on a subwoofer. Connecting the speaker output terminals of two amplifiers will, because of the\nway a fully digital amplifier works, seriously damage the amplifier.\n\n**Tips for setting up speakers**\nYou can use the stereo triangle as a good rule of thumb\nwhen determining where to place your speakers. The\ndistance between the speakers should be the same as the\ndistance from your listening position to both speakers.\n\nIf your room does not accommodate the optimal listening\nsetup, the TDAI- 2170 can compensate for this, when you\nenter the actual distances to each speaker through the",
      "page": 18
    },
    {
      "title": "Speaker setup guide",
      "content": "Reflections and Echoes\nThe direct sound from the speakers is strongly affected by\nthe dimensions of the room and the surfaces of the walls,\nfloor and ceiling. RoomPerfect™ will compensate for the negative effects experienced, but the reflections or echoes\nwill still reduce the perceived performance of the audio system.\n\n```\nANALOGINPUTOUTPUT INPUT OUTPUT\nA2 MICROPHONE\nLR\n```\n```\nRIGHT\nCLASS 2 WIRINGMIN 4Ω\n```\n```\nLEFT\nDIGITAL\nD\n```\n```\nD\nD3D4D5D6 RS\n```\n```\nTRIGGERIN\nA1 UPDATESW TRIGGEROUT TDAI 2170\nUSB AUDIO IN USB MODULE\n```\n```\nLR ANALOG AUDIO MODULE\nA3A4A5 A6 RIGHTA6 LEFT\n```\n```\nHDMI MODULE\nHDMI 1HDMI 2 INPUT HDMI 3HDMI 4OUT OUTPUT\n```\n\nYou can reduce reflections from the hard floors\nand hard surface walls by positioning a carpet,\npainting, a bookshelf, or other furnishings\nbetween you and the speakers and/or behind\nyou. Find the position of the diffusers by having\nsomeone hold a mirror flat against the wall or\nfloor. When you can see the speaker in the\nmirror from the listening position, you have\nfound the optimal position for the diffuser.\n\n**Note:**\nReducing reflections can also be achieved by spreading the direct reflection – these are known as diffusers. We do not\nrecommend extreme dampening of the room reflections – like in a public cinema. RoomPerfect™ works optimally in a\nroom with comfortable acoustics.\n\n**Speaker placement with RoomPerfect™**\nTraditionally speakers must be positioned in the room with different distances to back and side walls, so that sound\nreflecting from the walls does not reach your ear at the same time. This is to optimize the frequency response, but at\nthe cost of timing, as the reflections are causing a beat to be smeared out over a longer time.\n\n**With a RoomPerfect™ calibration** you can optimize the timing by placing your speakers against the back wall,\nopposite from your preferred listening position. This will ensure the largest sound reflection from the back-wall and\nthe direct sound will reach your ears at the same time, giving you better timing. The damage to the frequency\nresponse will be cleaned by RoomPerfect™\n\nIf your speakers have a bass-reflex port on the back, you should allow for a 5cm/2in clearance to the back wall. This\nwill ensure there is no disruption to the functionality of the port.\n\n**Connecting a subwoofer**\nThe TDAI-2170 features a crossover function for optimal\nintegration with a subwoofer.\n\nWhen connecting to a Lyngdorf BW type subwoofer, you connect\nthe analog output of the TDAI-2170 to the BYPASS input of the\nsubwoofer.\n\nIn a traditional single subwoofer setup, connect the subwoofer to\nthe left analog output on the TDAI-2170. For a stereo subwoofer\nsetup, or if you have a subwoofer which has stereo input, use both\nleft and right analog outputs.\n\n```\nLR ANALOGINPUT A2 OUTPUT MICROPHONE INPUTOUTPUT\n```\n```\nRIGHT CLASS 2 WIRINGMIN 4Ω LEFT\nD2D1D3D4 DIGITAL D5D\nRS\nTRIGGERIN\nUPDATESWTRIGGEROUT\n100-240 V ~ 50/60Hz 80W\nDesigned and manufactured in Denmark by SL Audio A/Swww.lyngdorf.com\nTDAI 2170\n```\n```\nAvertissement: Pour réduire le risque d'incendie et de décharge électrique l'appareil ne doit pas être exposé à l'eau ou à l'humiditéWarning. To reduce the risk of fire or electric shock, do not expose this apparatus to rain or moistureAudio Equipment3YZ\nA1 USB AUDIO IN USB MODULE\n```\n```\nLRA3A4 ANALOG AUDIO MODULE A5A6 RIGHTA6 LEFT HDMI 1HDMI 2 INPUTHDMI MODULE HDMI 3HDMI 4OUT OUTPUT\n```\n```\nANALOGINPUT OUTPUT\n```\n```\nA\n```\n```\nL\n```\n```\nR\nA\n```\n\n```\nSubwoofer controls\n```\n1. Phase adjustment should be 0°.\n2. The subwoofer cut-off frequency\nshould be set to the highest possible frequency\nrange.\n3. Level should be set to 50% of\nmaximum volume.\n\n**Warning:**\nDo not connect the TDAI-2170 to a subwoofer with High Level / speaker terminal inputs, as this will seriously damage\nthe amplifier.\n\n**Subwoofer placement**\nWith a single subwoofer, we recommend placing\nthe subwoofer against the wall between the main\nspeakers.\n\nWith two subwoofers, you should position one in\neach front corner, in line with the main speakers.\n\n**Measuring distances**\nWhen measuring the distance to your main speakers,\nmeasure from the preferred listening position (the\nfocus position) to the front of the speakers.\n\nWhen measuring the distance to a subwoofer,\nmeasure from the preferred listening position to the\nback corner of the subwoofer.\n\n```\nPhase Cut-off\n```\n```\n0 180 40 200\n```\n```\nLevel\n```\n```\n0 100\n```",
      "page": 19
    },
    {
      "title": "Using the TDAI-2170 in a Surround System",
      "content": "Integrating a TDAI-2170 with RoomPerfectTM into your surround sound setup enables you to make the most of your\nsystem’s front speakers and subwoofer(s) and enjoy the full benefits of RoomPerfectTM. The process is easier than\nyou might expect.\n\nImportant note: make sure your surround sound receiver has a front speaker “pre-out” connector.\n\n**Setup of surround receiver**\nOn the surround receiver, adjust the settings as follows:\n\n1. No subwoofer connected; this must be connected to the TDAI-2170 instead.\n2. Front speakers: X-Large, or corresponding reference for full frequency range speakers.\n3. Measure and set up the distances/delays to the front speakers.\n- Measure the distance to your front left and right speaker, and the subwoofer if you have one in your setup.\n- Take the longest distance measured and add 52 cm / 20.5 in. This adjusts for the delay caused by the processing\n    of the TDAI-2170.\n- Input this number for BOTH the left and right speaker in the surround receiver menu.\n4. Connect the surround processor ́s front speaker “pre-out” to a stereo analog input on the TDAI-2170.\n\n**Setup of the TDAI-2170 in a surround sound system**\nFor the TDAI-2170, adjust the settings as follows:\n\n1. Set up two front speakers, and subwoofer(s) as described in “Speaker setup guide” on page 6.\n2. Measure and input the correct distances to the speakers and subwoofer.\n3. Perform a RoomPerfectTM calibration of the stereo system.\n4. In the surround processor, adjust the levels to uniform between the surround, center, and stereo system.\n\n**Hot Tips**\n\nYou can set the TDAI-2170 to dedicate a specific Voicing when you select the input connected to the surround\nreceiver; see how in “4.1.4 Default voicing”.\n\nTurn the TDAI-2170 into a dedicated power amplifier when used in a surround sound setup.\nSelect the input connected to the surround processor and enter the menu system: 1. Go to ‘Setup’ / ‘Inputs’ / ‘Home\nTheater’ / Choose ‘Enable’.\n\n**Warning** : Do not test this setting with a CD player or similar unregulated signal!",
      "page": 20
    },
    {
      "title": "Menu walkthrough",
      "content": "",
      "page": 21
    },
    {
      "title": "1 RoomPerfectTM",
      "content": "Selects between the available focus and global RoomPerfect™ filters.\n\nRoomPerfect™ is designed to analyse and correct for the negative effects that the listening room has on the speaker\nsound. The focus filters improve the sound quality at a specific listening position, called a “focus position.” This makes\nthe focus filter the best solution for optimal sound quality at a single listening position.\nThe global filter improves sound quality across the whole room. When you are moving around a room, the global filter\ngives the best result.",
      "page": 22
    },
    {
      "title": "2 Voicing",
      "content": "Toggles between the available voicings, which adjusts the sound to your liking.\nA voicing is an equalizer filter that can be activated to amplify or attenuate certain frequencies according to your\npersonal preferences. This equalization is an addition to the RoomPerfect™ corrections. The equalizer settings of a\ngiven voicing can be seen on the display of the amplifier.\n\n**Hot Tip:**\nYou can set the TDAI-2170 to dedicate a specific voicing when you select the input connected to the surround\nreceiver; see how in “4.1.4 Default voicing” on page 13.",
      "page": 23
    },
    {
      "title": "3 Speaker setup",
      "content": "Select to toggle between speaker setup 1 and 2. _Note: Only active if enabled in Advanced Setting -> 2nd speaker setup._",
      "page": 24
    },
    {
      "title": "4 Setup",
      "content": "",
      "page": 25
    },
    {
      "title": "4.1 Inputs",
      "content": "In general, the settings in these sub-menus are specifically for the current active input.\nNote: We recommend setting the output of a CD-player to 44.1 kHz. The TDAI-2170 will then get the original signal\nfrom the disc, which allows for ICC (Intersample Clipping Correction) to function.\n\n**4.1.1 Active inputs**\nEnables and disables individual inputs so you do not have to scroll through unused inputs.\n\nNote: To store the changes made, scroll to the right in the menu and press the “Enter” button when you see “Enter to\ncontinue” text.\n\n**4.1.2 Input name**\nChanges the name of the selected input.\n\nNote: To remove all text after the blinking marker, press and hold the “Down” button on the remote.\n\n**4.1.3 Sensitivity**\nEnables you to match input levels from different sources. Can be adjusted up to +24dB.\n\n**4.1.4 Default voicing**\nSelects a default voicing for the input which is active when in this menu. If you always want extra bass on your gaming\nconsole audio, for example, set that voicing here.\n\n\n**4.1.5 Home Theater**\nTurns the amplifier into a dedicated power amplifier for the input which is active when in this menu. This feature\nbypasses the volume control. **Warning: Do not test this setting with a CD player or similar unregulated signal!**\n\nThis feature might be selected if you are using the TDAI-2170 in a home theater setup where it is used to power and\ncalibrate the front speakers and/or subwoofer. Connect your home theater processor to the selected input.\n\nWhen selecting other inputs, the amplifier returns to the last current volume.\n\n**4.1.6 Lipsync delay**\nIf the connection of a display has introduced asynchronous playback of audio and video, you can select a delay time in\nto ensure that the video and audio signals are played back simultaneously.",
      "page": 26
    },
    {
      "title": "4.2 RoomPerfectTM setup",
      "content": "**4.2.1 RoomPerfect™ guide**\nThis will start the guided RoomPerfect™ setup and will erase previously stored calibrations. When completed, the\nother menus are available in the RoomPerfect™ setup menu.\n\n**Placing the microphone in the focus position**\nWhen you are prompted to place the microphone in\nthe focus position, connect the microphone to the\nmicrophone input **on** the back panel using the\nprovided microphone cable and place the\nmicrophone, using the microphone stand, in your\nprimary listening position. The height and the\norientation of the microphone should correspond to\nyour head’s height and direction.\n\nPress enter and a test signal will start from the left\nspeaker. The TDAI-2170 will give an estimated\noptimal volume for calibrating the system or will\naccept the current volume. Adjust the volume if\nrequired and retry the measurement.\n\nThe calibration volume should not be so loud that it is inconvenient to you, or that it causes damage to your\nloudspeakers. If this is the case, set it to a lower and more appropriate level. A low volume can result in a longer\ncalibration time (in excess of two minutes) or a measurement time out. A low volume and long measurement will not\naffect the quality of the result.\n\n**Measuring the focus position**\nWhen the calibration volume has been set, RoomPerfect™ will send a range of tones to measure the focus position. If\nthere is noise in the room, the measurement may take longer. This will not affect the quality of the result.\n\nSee “RoomPerfect troubleshooting” on page 18 if you experience problems.\n\n**Measuring random room positions**\nWhen the focus position has been measured, the next step is to measure the acoustical properties of the room. It is\nimportant to perform well spaced measurements to get a comprehensive image of the acoustical properties of the\nroom. See “RoomPerfect troubleshooting” on page 18 if the measurement stops prematurely.\n\nKeep taking measurements until Room Knowledge reaches 90%, when the system has enough information to do a\ncalibration.\n\nThese are the rules of thumb when measuring the room:\n\n\n- the microphone must always have a clear line of\n    sight to the tweeter mid-range of the speaker.\n- the microphone should be in random and varying\n    positions, heights, and orientations.\n    Point it up/down/sideways, the more random\n    positions the better.\n- the measurements should cover the entire room,\n    not only your listening area.\n- the microphone should not be closer than\n    0.5m/1.5ft from the floor, ceiling and walls.\n- the microphone should be at least 1m/3ft from the\n    front of the loudspeakers.\n- there should be at least 50cm/1.5ft between each\n    measurement.\n- do NOT take symmetrical measurements in the room.\n\n**Room measurements above 90% Room Knowledge**\nNote that Room Knowledge is calculated by the computer as how much from the new measurement it already knows.\nIf the Room Knowledge index does not increase after a measurement, you have added a good measurement with a lot\nof new information.\n\nTo fully optimize RoomPerfect™’s understanding of the room’s acoustical properties, we recommend you keep doing\nmeasurements until the Room Knowledge is above 95%. The higher the Room Knowledge, the more accurate the\nroom correction filters will be.\n\n**4.2.2 Status**\nThis screen shows how many room measurements have been made, together with the RoomKnowledge and\nRoomCorrection index.\n\nThe Room Knowledge index is an estimate of how much of the room’s acoustical properties have been learned from\nthe room measurements. The higher the Room Knowledge index, the greater the accuracy of the calibration.\n\nThe Room Correction index is an estimate of how much the calibration filter will affect the sound reproduction by\nevaluating the size of the filters as well as the frequencies adjusted. This index is not absolute. For best results, rely on\nyour own experience of the effects of the filter.\n\nA low Room Correction filter on the focus position could indicate that you have positioned your speakers in order to\noptimize the frequency response and not the timing.\n\nCheck “Tips for setting up speakers” on page 6 and complete a new RoomPerfect™ calibration.\n\n**4.2.3 Add focus position**\nIf you would like to add an additional focus position, the chair next to the couch perhaps, it can be done here. It is\npossible to have up to 8 different focus positions.\n\nThe saved calibration volume from the RoomPerfect™ guided setup is used as a default when adding extra focus\npositions. The volume can be changed at any time between measurements to suit a particular situation. This will not\naffect the quality of the measurement or the end result.\n\n**Add room measurement**\n\n```\n0.5 m / 1.5ft\n```\n```\n0.5 m / 1.5ft\n```\n```\nMin.\n0.5m /\n1.5ft 1m /\n3ft\n```\n```\nMin.\n0.5m\n1.5ft\n```\n```\n1m /\n3ft\n```\n```\n0.5 m / 1.5ft\n```\n\nIt is possible to add more room measurements, which can increase RoomKnowledge and thereby fine tune all the\nroom correction filters.\n\n**Status**\nThis screen shows how many room measurements have been made, together with the Room Knowledge and Room\nCorrection index.\n\nThe Room Knowledge index is an estimate of how much of the room’s acoustical properties have been learned from\nthe room measurements. The higher the Room Knowledge index, the greater the accuracy of the calibration.\n\n**Hot Tip:** The objective is to have the Room Knowledge index to increase as slowly as possible. This indicates that each\nmeasurement holds new data for the calibration. When the measurement does not give new data, the index will\nincrease quickly.\n\nThe Room Correction index is an estimate of how much the calibration filter will affect the sound reproduction by\nevaluating the size of the filters as well as the frequencies adjusted. This index is not absolute. For best results, rely on\nyour own experience of the effects of the filter.\n\nA low Room Correction filter on the focus position could indicate that you have positioned your speakers in order to\noptimize the frequency response and not the timing.\n\nCheck “Tips for setting up speakers” on page 6 and complete a new RoomPerfect™ calibration.\n\n**Add focus position**\nIf you would like to add an additional focus position, the chair next to the couch perhaps, it can be done here. It is\npossible to have up to 8 different focus positions.\n\nThe saved calibration volume from the RoomPerfect™ guided setup is used as a default when adding extra focus\npositions. The volume can be changed at any time between measurements to suit a particular situation. This will not\naffect the quality of the measurement or the end result.\n\n**Add room measurement**\nIt is possible to add more room measurements, which can increase Room Knowledge and thereby fine tune all the\nroom correction filters.",
      "page": 27
    },
    {
      "title": "4.3 Volume",
      "content": "**4.3.1. Default volume**\nThe default volume setting controls the default volume at start-up.\n\n**Maximum volume**\nThe maximum volume setting is a safety precaution used for limiting the maximum volume which can be achieved by\nspinning the wheel or increasing volume via the remote. This can be set to protect your loudspeakers against\noverload.",
      "page": 28
    },
    {
      "title": "4.4 Voicings",
      "content": "Enables and disables voicings to enable quicker selection of your preferred equalization.",
      "page": 29
    },
    {
      "title": "4.5 Display",
      "content": "**4.5.1 Display brightness**\nDisplay brightness is used to control the brightness of the display.\n\n\n**4.5.2 Display timeout**\nIf enabled, the main display will switch off after 10 seconds of inactivity.",
      "page": 30
    },
    {
      "title": "4.6 HDMI",
      "content": "Note: As default, CEC is not active on HDMI to comply with regulations requiring a very low standby power. Turning it\non will raise standby power to 1.2W.",
      "page": 31
    },
    {
      "title": "NOTE:",
      "content": "Consumer Electronics Control (CEC) is an HDMI feature designed to allow you to command and control CEC-enabled\ndevices that are connected through HDMI, by using only one of their remote controls (for example, controlling the\nTDAI-2170 audio by using the remote control of the TV).\n\nThe level of CEC implementation depends on the manufacturer of each product,\nand even if brand new, not all electronic devices, including TV or other sources, support CEC.\n\n**4.6.1 CEC enable**\nEnables and disables CEC (Consumer Electronics Control) over HDMI.\n\n**4.6.2 CEC power control**\nNote: Menu only appears if CEC is enabled.\nEnables and disables CEC power handling.\n\nThis means when you turn on your TV or Blu-Ray player, the TDAI-2170 will automatically switch on from standby as\nwell. Furthermore, if you switch the HDMI input to a product which is in standby, it will be turned on.\n\n**4.6.3 CEC audio system**\nEnables and disables CEC audio system.\n\nWhen enabled the TDAI-2170 tells the TV to disable its built-in speaker and to use the ones connected to the TDAI-\n\n2170. Furthermore, this enables you to control the TDAI-2170 volume with the TV ́s remote\n\n**4.6.4 TV input**\nSelect “HDMI ARC” if your TV supports ARC (Audio Return Channel) over its HDMI connection.\nThis means your TV can stream audio back through its HDMI connection to the TDAI-2170.\n\nIf your TV doesn ́t support ARC, you can connect an analog or digital audio output from the TV to an audio input on\nTDAI-2170. Select the used input in this menu so the TDAI-2170 will know from which input the audio from the TV is\ncoming. Remember to set up the TV to output to PCM on the digital output.\n\nNote: If you don ́t get any sound when the TV is connected to an alternative audio input, you may need to turn off\nyour TV and turn it back on again.\n\n**4.6.5 Output enable**\nEnables and disables HDMI audio output to the TV. This feature is only available if the digital output connector is not\nin use.\n\nWhen enabled, this feature will send the current digital audio signal though the HDMI cable to the TV. Disable if you\nwant the TDAI-2170 to send the current audio signal to the digital output connector on the back.",
      "page": 32
    },
    {
      "title": "5 Advanced settings",
      "content": "",
      "page": 33
    },
    {
      "title": "5.1 Auto off",
      "content": "If you don ́t press any buttons or audio isn ́t being played, this sets the idle time required for automatic shut-down of\nthe amplifier.",
      "page": 34
    },
    {
      "title": "5.2 Remote control",
      "content": "Activate or deactivate the remote control. This function is useful if you are using a home automation system and other\nremotes are using the same IR codes as the TDAI-2170 remote.\n\nA home automation system is connected to the TDAI-2170 through the RS232 connector. Codes are available for\ndownload from [http://www.lyngdorf.com](http://www.lyngdorf.com)",
      "page": 35
    },
    {
      "title": "5.3 ICC",
      "content": "Audio signals that exceed 0 dBFS (decibels relative to full scale) will be clipped when processed in the audio chain and\nwill result in more or less distortion. With ICC (Intersample Clipping Correction) the TDAI-2170 will dynamically allow\nfor extra headroom to avoid clipping.\nICC (Intersample Clipping Correction) can be set to auto or disabled.\nThe TDAI-2170 will continuously adjust the ICC in order to avoid clipping. Changing inputs or going into standby mode\nwill reset the ICC.\n\nIf you switch to an active audio input and press info on the remote, you will see a “peak level” measurement. This will\nshow you if your signal has exceeded 0 dBFS. ̈",
      "page": 36
    },
    {
      "title": "5.4 Speaker setup guide",
      "content": "This starts the guided speaker setup and RoomPerfect™ setup. See “RoomPerfect” on page 10 for instructions in how\nto calibrate your system.\n\nWarning: This will erase all previously stored speaker settings and RoomPerfect™ measurements.",
      "page": 37
    },
    {
      "title": "5.5 Second speaker setup",
      "content": "Here you have the option to store a second speaker setup. This will allow you to test another setup or to have\ncalibrated setups with and without a subwoofer, etc.\n\nEnabling this will start the Guided Speaker Setup. When complete, the menu item Speaker Setup will be available in\nthe main menu, allowing you to switch between the two setups.",
      "page": 38
    },
    {
      "title": "5.6 Outputs",
      "content": "The menus in outputs are where you will manually set up delays and crossover filters for your speaker system. If the\nguided speaker setup has been completed the pre-made settings will be shown; these can be optimized as well.\n\nWhen building active speaker systems, it is recommended that you use the original crossover point(s) used by the\nmanufacturer. Due to the short wavelengths of the mid/high frequencies, it is essential that crossover frequency, filter\ntype, order, and delay are set correctly. Therefore, creating filters for speakers is an iterative process that requires\ngreat knowledge and several critical listening sessions in order to achieve seamless integration of the different\nspeaker drivers.\nNote: If you change the output setting, you have to do a new RoomPerfectTM calibration.\n\n\n**5.6.1 Delays**\nThe available settings are:\n\nDistance\nIf you are using a setup with speakers and/or subwoofers located at an identical distance to the listening position, you\ndon’t need to set a distance. If the distances are not identical, you need to enter it in order to ensure that the sound\nfrom each loudspeaker reaches the listening position simultaneously.\n\nTo correctly measure the distance, please see Guided Speaker Setup.\n\nAmplifier delay\nOn analog and digital out, you can set an amplifier delay. If you have an active subwoofer or an additional amplifier,\nthere will be a natural electronic delay in these products.\n\nRefer to the original manufacturer’s instructions to obtain the correct amplifier delay.\n\n**5.6.2 Main speaker output**\nThe available settings are:\n\nHigh pass removes the frequencies below the crossover frequency.\nLow pass removes the frequencies above the crossover frequency.\nFull range allows the signal to pass unfiltered.\nOff mutes the output.\n\n**5.6.3 Analog output**\nThe available settings are:\n\nHigh pass removes the frequencies below the crossover frequency.\nLow pass removes the frequencies above the crossover frequency.\nFull range allows the signal to pass unfiltered.\nHeadphone disables RoomPerfect™, voicings are still available. Muting the TDAI-2170 will only mute the speakers, not\nthis output.\nTape Out disables RoomPerfect™, voicings and volume control.\nOff mutes the output.\n\nVolume\nThe volume can be set to regulated or full scale. Regulated means that the output level will follow the level of the\nvolume control. Full scale means there is a constant full scale output.\n\nWarning: If full scale is selected, you will have full volume output, and this can overload and damage speakers.\n\nOutput level\nThis adjusts the overall output level in order to align the level of a subwoofer to the level of your main speakers.\nMaking the output adjustment here is far better than attenuating the level on the subwoofer itself.\n\nL/R signals\nChoose whether you want the output to be a stereo or mono signal. Choose mono if you use a single subwoofer with\nmono analog input; choose stereo if you have two subwoofers or one with a stereo input. See “Connecting the\nsubwoofer” chapter.\n\n\n**5.6.4 Digital output**\nThe available settings are:\n\nHigh pass removes the frequencies below the crossover frequency.\nLow pass removes the frequencies above the crossover frequency.\nFull range allows the signal to pass unfiltered.\nHeadphone disables RoomPerfect™, voicings are still available. Muting the TDAI-2170 will only mute the speakers, not\nthis output.\nTape Out disables RoomPerfect™, voicings and volume control.\n\nVolume\nThe volume can be set to regulated or full scale. Regulated means that the output level will follow the level of the\nvolume control. **Warning:** If full scale is selected, you will have full output to your speakers, which can overload and\ndamage them.\n\nOutput level\nThis adjusts the overall output level in order to align the level of a subwoofer to the level of your main speakers.\nMaking the output adjustment here is far better than attenuating the level on the subwoofer itself.\n\nL/R signals\nChoose whether you want the output to be a stereo or mono signal. Choose mono if you use a single subwoofer with\nmono digital input; choose stereo if you have two subwoofers or one with a stereo input.\n\n**5.6.5 Low pass filter**\nIf a filter is selected, the frequencies below the selected crossover frequency will be directed through the designated\noutput terminals.\n\nThe available settings are:\nType\nLR: (Linkwitz Riley) 2nd, 4th or 8th order.\nBW: (Butterworth) 1st, 2nd or 4th order.\n\nIn setups using conventional active subwoofers, we recommend using a 2nd order Butterworth filter.\nIn active speaker systems, we recommend starting with a 4th order Linkwitz Riley filter.\nIn a configuration with Lyngdorf Audio BW-1 speakers, we recommend using a 4th order Linkwitz Riley filter.\n\n**5.6.6 High pass filter**\nIf a filter is selected, the frequencies above the selected crossover frequency will be directed through the designated\noutput terminals.\n\nThe available settings are:\nType\nLR: (Linkwitz Riley) 2nd, 4th or 8th order.\nBW: (Butterworth) 1st, 2nd or 4th order.\n\nChoose a filter type that matches the one you have selected for the low pass filter.\n\nFrequency\nThe crossover frequency can be selected anywhere between 20 – 9999Hz.\n\n**5.7 Subsonic Filter**\nEnables and disables a filter to remove all sound below 18 Hz.",
      "page": 39
    },
    {
      "title": "5.7 Trigger mode",
      "content": "The trigger input can be used to activate the TDAI-2170 from a source.\nThe available settings are Amp. Power Mode or a specific input.\n\nAmp. Power Mode will start the TDAI-2170 on the input last used.\nIf you want the TDAI-2170 to start on a specific input when triggered, choose it here.\nNote: If the TDAI-2170 has been switched to another input, the trigger command from the source connected will not\nturn off the amplifier.",
      "page": 40
    },
    {
      "title": "5.8 Lock setup",
      "content": "Lock the menu system to avoid unintentional changes.\nUnlock the menu system by entering the code 7800. When the code has been entered, and you exit the setup menus,\nthe menu lock will reactivate automatically after 5 minutes.",
      "page": 41
    },
    {
      "title": "5.9 Software info",
      "content": "Lists the software versions the TDAI-2170 is using. Refer to [http://www.lyngdorf.com](http://www.lyngdorf.com) for the latest software.\n\nTo update the TDAI-2170:\nSave the new software on a FAT formatted USB drive.\nInsert the USB drive into the “SW Update” connector on the back of the TDAI-2170.\nTurn off the TDAI-2170 at the main switch on the back.\nHold down the standby button on the front and turn on the main switch on the back.\nWhen the display says UPDATING, release the standby button and the TDAI-2170 will update the software. When the\nupdate is finished, the amplifier goes into standby.",
      "page": 42
    },
    {
      "title": "5.10 Factory reset",
      "content": "Restores the system to the default factory settings.\n\nWarning: All user preference settings, system data, and RoomPerfect™ data are lost when restoring to default\nsettings!\n\n**Connecting a PC to the USB B input / streaming audio driver**\n\nTo stream audio from a Windows PC to the TDAI-2170, you need to install a dedicated Windows drivers (includes ASIO\ndriver) on your pc, which will ensure correct operation and optimal performance. The driver can be found on\n[http://www.lyngdorf.com.](http://www.lyngdorf.com.) Mac and Linux users do not need to install any drivers to stream audio to the TDAI-2170.\n\nUsing the USB streaming audio input\nTo stream music to the TDAI-2170, connect it to your computer via a USB cable.\nSelect “USB” as input on the TDAI-2170 and start playing music on your computer.",
      "page": 43
    },
    {
      "title": "FAQ and recommendations",
      "content": "_When do I need to do a new RoomPerfect™ calibration?_\nIf you change the position of speakers, the crossover settings or if you change your furniture position or type, you\nneed to do a new calibration, as these changes have an impact on the room acoustics.\n\n_What should I set my CD-players sample rate output to?_\n44.1 kHz. This will allow the ICC feature of the TDAI-2170 to avoid clipping of the signal.\n\n_What does the Info button on the remote do?_\nIf you switch to an active audio input and press Info on the remote, you will see the following:\n\n_Peak Level_\nThis will show you the peak signal relative to 0 dBFS (decibels relative to full scale) and is used for manually setting up\nthe Input Gain or ICC (Intersample Clipping Correction). If the peak level shows +3.4, you should set the ICC to -3.4.\n\nWhen you switch to a new input or go into standby mode, all measurements, including Peak Level, are reset. If you\nstay on an input, the Peak Level data is stored, and the maximum value is shown.\nNote: We recommend that you set the ICC function to AUTO, which will activate if a signal is too high.\n\n_Sample frequency_\nSample frequency of the input signal.\n\n_Bit resolution_\nResolution of the digital input signal.\n\n_Audio format_\nCan show the following: No signal / PCM / DSD / Unknown\nIf Unknown is shown, the TDAI-2170 cannot read the type of signal and you will not hear anything from your speakers.\n\n_My remote control does not work properly_\nPress the “AMP” button to enable the remote control to operate the TDAI-2170 amplifier.\nThe multifunction remote control can operate several Lyngdorf Audio products.\nCheck the batteries.",
      "page": 44
    },
    {
      "title": "RoomPerfectTM troubleshooting",
      "content": "The calibration microphone is very sensitive and may pick up unwanted noise, including subsonic signals and\nbackground noise, which disturbs the measurements. If the signal is disturbed it will take longer for the system to\nmake a correct measurement.\n\nA measurement that has been disturbed by noise but completed will always be correct; it is not necessary to redo it. If\nthe measurement has stopped due to an error, one of the following error messages will be shown.\n\nSignal error! Check microphone and cable, then press enter\nNo microphone is connected, or the microphone cable is not working. Check that the microphone cable is connected\nto the microphone socket on the back panel. If the problem continues, test the microphone cable by connecting the\nmicrophone directly to the microphone socket and select Retry.\n\nIf the microphone is detected, replace the microphone cable and retry the measurement.\nError: Signal clipping - or - Error: Too much noise\nEither the incoming signal has been classified as too loud, resulting in clipping or distortion, or a loud noise in the\nimmediate environment has corrupted the measurement results. If a loud noise has in fact occurred, such as the\nsound of a closing door, reduce noise levels inside and in the immediate vicinity of the room and repeat the\nmeasurement. If no loud noise has occurred, reduce the volume of the signal and repeat the measurement.\n\nError: Signal too low.\nThis error message is displayed when the measurement has lasted more than 5 minutes for the low-frequency signal\nor more than 2 minutes for the high-frequency signal. This happens most often when using a low-level measuring\nsignal compared to the background noise in the listening environment, which results in prolonged measuring times.\nRaise the measuring signal volume or reduce the noise in the environment before continuing with the measurement.",
      "page": 45
    },
    {
      "title": "Cleaning and maintenance",
      "content": "The TDAI-2170 does not require any regular maintenance except to keep its exterior clean. Simply wipe it with a clean,\nsoft cloth. A small amount of non-abrasive cleaner may be used on the cloth to remove any dirt or fingerprints. Do not\nuse abrasive cleaners or cleaners containing liquid solvents.",
      "page": 46
    },
    {
      "title": "Serial control manual",
      "content": "To get a copy of the Serial Control Manual, which describes how the serial control interface of the device works,\ndownload it from [http://www.lyngdorf.com,](http://www.lyngdorf.com,) or contact your local Lyngdorf Audio representative.\n\nWriting software for controlling requires special knowledge. Lyngdorf Audio will not support in writing any serial\ncontrol software.",
      "page": 47
    },
    {
      "title": "Technical assistance",
      "content": "For the latest version of this manual, please check the Lyngdorf Audio website: [http://www.lyngdorf.com.](http://www.lyngdorf.com.)\n\nIf you have any problems with or questions regarding your Lyngdorf Audio product, please contact\nyour nearest Lyngdorf Audio representative or:\n\n**SL Audio A/S\nUlvevej 28, 7800 Skive, Denmark\nE-mail: contact@lyngdorf.com\nWeb: [http://www.lyngdorf.com](http://www.lyngdorf.com)**",
      "page": 48
    },
    {
      "title": "4.",
      "content": "",
      "page": 49
    }
  ]
}